{"pageContext":{"postsByTag":[{"excerpt":"왜 이런 짓을 하게 되었는가 이 글은 일단 제목부터 심상치 않은 글이다. “멀쩡한 랩탑 두고 왜 이런 짓을 하는건가?” 하는 어그로 글일 수도 있겠다. 물론 나도 같은 생각을 했었고, 몇 해에 걸친 고민과 삽질 끝에 1차 시도를 마치게 되어 다른 분들에게 도움이 되었으면 좋겠다는 생각으로 글을 남긴다. 내가 얼마 전까지 사용하던 기기 구성은 아래와 같았다. 2017년형 맥북 프로 터치바 15인치 2016년형 맥북 12인치 아이패드 프로 10.…","html":"<h2 id=\"왜-이런-짓을-하게-되었는가\"><a href=\"#%EC%99%9C-%EC%9D%B4%EB%9F%B0-%EC%A7%93%EC%9D%84-%ED%95%98%EA%B2%8C-%EB%90%98%EC%97%88%EB%8A%94%EA%B0%80\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>왜 이런 짓을 하게 되었는가</h2>\n<p>이 글은 일단 제목부터 심상치 않은 글이다. “멀쩡한 랩탑 두고 왜 이런 짓을 하는건가?” 하는 어그로 글일 수도 있겠다. 물론 나도 같은 생각을 했었고, 몇 해에 걸친 고민과 삽질 끝에 1차 시도를 마치게 되어 다른 분들에게 도움이 되었으면 좋겠다는 생각으로 글을 남긴다.</p>\n<p>내가 얼마 전까지 사용하던 기기 구성은 아래와 같았다.</p>\n<ul>\n<li>2017년형 맥북 프로 터치바 15인치</li>\n<li>2016년형 맥북 12인치</li>\n<li>아이패드 프로 10.5인치</li>\n</ul>\n<p>15인치 맥북 프로는 회사 지급품이자 메인 개발 머신이고, 맥북 12인치는 가볍게 들고나가 개발을 할 일이 있을 때나 회사에서 주로 회의만 하는 날에 가벼운 서브 머신으로 들고나가곤 했다. 특별한 일이 없으면 아이패드 프로를 들고 나가서 대중교통 안에서 책을 읽거나 <a href=\"https://lunadisplay.com\">Luna DIsplay</a>와 함께 외장 디스플레이로 사용했다. 어느정도 나누어진 역할에 따라 각 기기를 만족스럽게 쓰고는 있었지만, 요즘 내 생활 패턴 상 안맞는 부분이 있었다.</p>\n<ol>\n<li>맥북 12인치는 1주일에 한두번밖에 쓰지 않는다.</li>\n<li>아이패드는 자주 쓰지만 주로 집이나 책상 위 등 한정된 공간에서만 사용한다. 원격 근무 위주로 하다 보니 대중교통을 이용할 일이 적어진데다, 대중교통에서 꺼내드는 것도 점차 귀찮아져서 가벼운 독서는 아이폰을 이용한다.</li>\n</ol>\n<p>어차피 나에게 아이패드는 반드시 사용하는 기기이고, 15인치의 무거움만 감수하면 12인치는 굳이 필요가 없기 때문에 두 기기를 처분하고 <a href=\"https://www.apple.com/kr/ipad-pro/\">아이패드 프로 3세대 12.9인치</a>를 들이기로 결심했다. 펜슬, 폴리오 커버까지 셋트 다 갖추어 사니까 이번에 나온 신형 맥북 에어 13인치 가격과 비슷했다 💸</p>\n<p>이번에 산 아이패드는 화면이 꽤 큰 것 치고는 무게도 현실적으로 괜찮고, 성능은 차고 넘치기 때문에 몇일 동안 써본 결과 아주 만족스럽다. 하지만 이 글은 기기를 리뷰하는 글이 아니라 아이패드를 통해 어떻게 원격 개발 환경을 구축하는가를 이야기하는 글이기 때문에 사용기가 궁금한 분들은 유튜브나 커뮤니티 곳곳에 있는 사용기를 참고하시기 바란다.</p>\n<p>이전에도 아이패드로 가벼운 개발을 시도해보려고 했던 적이 여러 번 있었다. 문제는 내가 <strong>프론트엔드 개발자</strong> 라는 것인데, iOS에서 적당한 IDE나 텍스트 에디터도 없는 데다 결과물을 바로 확인해보기도 어렵고 브라우저의 개발자 도구를 이용하기도 어렵다. 불가능하진 않지만 여러모로 한정적이다.</p>\n<p>구글에 ‘iPad pro web development’ 같은 검색어로 여러 글을 찾아 보았지만 언제나 비슷한 결론에 이른다. ‘VPS 등으로 원격 머신을 세팅하여 그 머신에 SSH, mosh 등으로 연결하여 vim 으로 코딩을 한다’ 는 것이다. vim빠로서 별로 마다할 선택지는 아니지만, 다시 강조하건대 내가 개발하는 분야는 웹 브라우저의 개발자 도구 없이는 제대로 된 개발을 할 수가 없다. 그게 아니라면 멀리 돌아갈 필요 없이 몇몇 좋은 앱이 있다. 특히 파이썬 사용자라면 <a href=\"http://omz-software.com/pythonista/\">Pythonista</a>라는 앱을 강력하게 추천한다. 이건 진짜 iOS용 파이썬 IDE다.</p>\n<p>요즘은 <a href=\"https://codesandbox.io\">codesandbox.io</a>, <a href=\"https://glitch.com\">glitch.com</a> 같은 서비스가 있어서 가벼운 샌드박싱은 충분히 가능하긴 하지만, PC버전에 비해 iOS 사파리로 프로그램을 만들 때 자동완성이나 키 입력 등의 제약이 좀 있다. 그래서 관심 있는 분들은 사용해보면 좋지만 이 글에서 이야기하는 본격적인 개발과는 조금 다르다.</p>\n<p><strong>그리고 결국 마지막에 이르러 “원격 데스크탑으로 내 맥에 접속해서 개발을 한다” 라는 원초적인 선택지를 고르게 되었다.</strong></p>\n<h2 id=\"ios용-원격-데스크탑-앱을-고르고-설정하기\"><a href=\"#ios%EC%9A%A9-%EC%9B%90%EA%B2%A9-%EB%8D%B0%EC%8A%A4%ED%81%AC%ED%83%91-%EC%95%B1%EC%9D%84-%EA%B3%A0%EB%A5%B4%EA%B3%A0-%EC%84%A4%EC%A0%95%ED%95%98%EA%B8%B0\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>iOS용 원격 데스크탑 앱을 고르고 설정하기</h2>\n<p>몇몇 원격 접속 앱들이 있지만 여러 앱을 사용해 보고 두 가지 앱이 아주 좋다는 결론을 냈다.</p>\n<ol>\n<li><a href=\"https://jumpdesktop.com\">Jump Desktop</a> - 보통 최고의 원격 데스크탑 앱으로 꼽힌다. 호환되는 <strong>비싼</strong> 마우스를 쓰면 iOS 원격 앱에서 마우스도 쓸 수 있다는 어마어마한 장점이 있지만 스크린에 터치하는데 좀 익숙해지면 마우스는 굳이 필요 없겠다는 생각이 들었다.</li>\n<li><a href=\"https://edovia.com/en/screens-ios/\">Screens</a> - 맥 계열에 역사와 전통이 깊은 VNC 앱이다. VNC 프로토콜의 한계 상 소리 출력은 되지 않지만 Jump Desktop보다 훨씬 뛰어난 사용자 환경을 제공한다. 인앱(In-app) 구매를 하면 다른 iOS 기기를 트랙패드처럼 쓸 수 있게 해주는 기능도 제공한다.</li>\n</ol>\n<p>두 앱 다 호스트가 되는 맥에 연결 앱을 설치해주고 자체 계정으로 로그인을 해주면 대체적으로 설정이 완료된다. (네트워크 환경에 따라 수동 설정을 해야 하는 경우도 있다) 처음에는 Jump Desktop 만으로 모든게 해결될 줄 알았는데 밖에 나오니 연결이 안될 때가 있고, UI가 좀 아쉬워서 Screens를 시도해 보고 있다. 원격으로 접속 시 제대로 호스트가 잡히지 않을 수 있다는 단점을 극복하기 위해 집 공유기에 OpenVPN 설정을 하여 언제든지 외부에서 VPN 접속을 할 수 있도록 만들었다.</p>\n<p>또한 아무리 맥에 원격 접속을 위한 데몬이 돌아가고 있다 하더라도 잠자기 상태면 전혀 연결이 되지 않기 때문에 맥을 켜두고 밖에 나오면서 <a href=\"https://itunes.apple.com/kr/app/amphetamine/id937984704?mt=12\">Amphetamine(암페타민)</a>같은 앱으로 스크린을 닫아도 잠들지 않게 만드는 것도 중요하다.</p>\n<p>그러면 외부에서도 아래와 같이 원격 앱에서 접속 가능한 상태가 된다. (위는 Jump Desktop, 아래는 Screens)</p>\n<p><img src=\"https://cl.ly/051211abbcf8/remote-app-jump-desktop.PNG\" alt=\"remote app - jump desktop\">\n<img src=\"https://cl.ly/cd251f3443a2/remote-app-screens.PNG\" alt=\"remote app - screens\"></p>\n<p>아이패드에 블루투스 키보드를 연결한 환경에서 사진과 같이 VSCode를 띄우고 블로그의 간단한 태그를 수정한 다음 배포하는 것 까지 생각보다 깔끔하게 가능했다. 또 한가지 유의할 점은 호스트 맥의 디스플레이 해상도를 미리 1440x900 정도로 조절해두는 게 보기 편하다는 것이다. 아마 더 작은 아이패드를 쓰고 있다면 1280x800 정도의 해상도가 편하리라 생각한다.</p>\n<p><img src=\"https://cl.ly/309a15125452/remote-connect.JPG\" alt=\"screens로 원격 접속한 모습\"></p>\n<p>참고로 Jump Desktop은 아이패드 앱으로 원격 호스트에 접속할 때 해상도를 아이패드 네이티브 해상도에 맞게 조절하는 기능을 최우선적으로 열심히 개발하고 있다고 한다. 윈도우 호스트에 접속할 때는 이미 잘 되는 기능이지만, 윈도우 머신이 없기 때문에 실험해보지 못했다.</p>\n<h2 id=\"몇-가지-트러블슈팅\"><a href=\"#%EB%AA%87-%EA%B0%80%EC%A7%80-%ED%8A%B8%EB%9F%AC%EB%B8%94%EC%8A%88%ED%8C%85\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>몇 가지 트러블슈팅</h2>\n<p>원격 접속 환경이 일반 맥과 완전히 동일하지 않기 때문에 사용자가 직접 버릇을 바꾸어야 하는 불편한 점이 몇개 있다. 다행히도 나는 참을만하면 내가 직접 버릇을 고치는 편이기 때문에 몇 달 적응해보고 실제 어떻게 활용하고 있는지 추가로 포스팅할 예정이다. 그 전에 몇 가지 눈에 띄는 불편한 점을 어떻게 해결했는지 공유하고자 한다.</p>\n<ul>\n<li>스팟라이트(혹은 알프레드)를 Cmd+Space로 쓸 수 없다 - iOS의 스팟라이트가 실행되기 때문인데, 호스트 머신의 스팟라이트 단축키를 Alt+Space로 변경하면 충돌이 나지 않는다. 나는 기존대로 Cmd+Space는 바꾸지 않은 채 <a href=\"https://www.keyboardmaestro.com/main/\">Keyboard Maestro</a>라는 앱으로 별도의 키바인딩을 했다. 굳이 이 앱 아니어도 <a href=\"https://folivora.ai\">BetterTouchTool</a> 정도만 되어도 충분하다. (어차피 나는 둘 다 쓴다)</li>\n<li>만약 한영 전환을 Cmd+Space로 쓰는 분이 있다면 마찬가지로 불편할 텐데, 나는 이미 오래 전부터 Shift+Space로 한영 전환을 하고 있기 때문에 별 문제가 되진 않았다.</li>\n<li>macOS Mojave에서 VNC 프로토콜의 키보드 입력이 좀 꼬여있는지 애플이 수정할 예정이라고 한다. 그 전에는 컨트롤+방향키 조합, 펑션키 입력 등에 제약이 있기 때문에 미션 컨트롤을 부르는 단축키를 <code class=\"language-text\">Ctrl+Shift+M</code> 등으로 임의 설정을 해주어야 한다고 한다. <a href=\"https://help.edovia.com/hc/en-us/articles/360011679794-3-finger-swipe-gestures-are-not-working-with-macOS-10-14-Mojave\">참고 링크</a></li>\n<li>ESC키를 쓸 수 없다. 외장 블루투스 키보드를 아이패드에 연결한 채 ESC를 누르면 홈 화면으로 돌아올 것이다. 만약 vim 사용자라면 <code class=\"language-text\">Ctrl+[</code> 을 사용하는데 익숙해져야 할 것이다.</li>\n<li>iOS 환경에서 Caps Lock 버튼을 임의로 Ctrl로 바인딩 할 수 없다. iOS가 아닌 환경에선 여태까지 그렇게 써 왔는데 안되는게 아쉽지만, 자주 원격 접속을 하진 않을 테니까 견딜만 하다.</li>\n<li>마우스가 안된다는 것은 보통 치명적인 단점이긴 한데 사전에 이야기한 대로 아직은 손가락이나 애플 펜슬을 이용하여 포인팅을 대신 해도 쓸만하다. 직접 터치한 부분이 마우스 클릭이 되는 터치 모드보다는 실제 트랙패드처럼 손가락 움직이는대로 마우스 커서가 움직이는 트랙패드 모드를 사용하는게 나에게 더 맞았다.</li>\n<li>분명 암페타민으로 맥을 잠들지 않게 했음에도 밖에 나가서 접속하려고 하면 원격 앱으로 맥에 접속할 수 없는 상태가 되는 경우가 많았다. 최대한 불안 요소를 없애기 위해 언제든지 집 공유기 VPN으로 접속할 수 있도록 만든 뒤, 공유기 설정으로 들어가 맥에다 직접 패킷을 쏴 주어 깨우는 방식으로 문제를 해결했다.</li>\n</ul>\n<h2 id=\"마치며\"><a href=\"#%EB%A7%88%EC%B9%98%EB%A9%B0\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>마치며</h2>\n<p>아직 간단히 몇 줄을 수정한 뒤 커밋-푸시하는 정도의 단계만 수행해봤지만, 조금만 익숙해지면 하루 정도 밖에 나와서 아이패드로만 일을 하거나 사이드 프로젝트를 하는 정도는 별로 무리 없이 진행할 수 없으리라 기대한다. 특히 Jump Desktop 쪽에서 아이패드 해상도 대응 업데이트만 되면 더더욱 괜찮은 환경을 구축할 수 있을 것 같다.</p>\n<p>아직까진 삽질만 잔뜩 하고 눈에 띄는 성과가 없긴 하지만 몇개월 더 이런 방식으로 아이패드를 활용해 보면 어떻게 느끼게 될지 궁금하다.</p>\n<h2 id=\"추가-업데이트\"><a href=\"#%EC%B6%94%EA%B0%80-%EC%97%85%EB%8D%B0%EC%9D%B4%ED%8A%B8\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>추가 업데이트</h2>\n<p>(2019년 3월 9일) Jump Desktop의 iOS, Mac Client 버전이 업데이트 되면서 불편했던 점이 아주 많이 개선되었다. 업데이트 로그는 다음과 같다.</p>\n<ul>\n<li>Dynamic resolution switching for Fluid connections: Jump can now update the remote resolution to match your local device's resolution and orientation.</li>\n<li>Wake-On-Lan for automatic connections: Jump will try to wake up your remote machine before connecting (there are some limitations here though)</li>\n<li>Better keyboard compatibility with games and 3D applications</li>\n<li>Horizontal scrolling support.</li>\n<li>Synchronize automatic connection names</li>\n<li>Physical keyboard improvements</li>\n<li>External screen improvements</li>\n</ul>\n<p>업데이트 내역에서 중요한 개선은 3가지였다. 가로 스크롤이 가능해졌고, 원격 접속 상태에서 아이패드 해상도에 맞게 조절이 가능하며 블루투스 키보드 입력 시 제대로 입력되지 않았던 일부 키 동작들이 수정된 것이다.</p>\n<p>덕분에 실질적으로 서브 랩탑을 대체할만한 수준까지 사용성이 많이 좋아졌다고 생각한다. Screens는 그저 사용성 좋은 VNC 애플리케이션에 지나지 않아서 이제는 자주 쓰기 힘들 것 같다.</p>\n<p><img src=\"https://cl.ly/08a4aacac432/remote-connect-2.png\" alt=\"Jump desktop improved\"></p>","id":"7715abb9-36ad-553f-8980-b93fac560c0c","frontmatter":{"date":"2019-02-06","path":"/posts/how-to-remotely-connect-with-your-mac-using-ipad","title":"아이패드로 맥에 원격 접속하여 (프론트엔드) 개발하기","tags":["Programming","Tools","Remote Job"],"category":"Tool"}},{"excerpt":"Ruby on Rails(이하 레일즈) 를 쓰는 사람이라면 DHH(데이비드 하이네마이어 한슨)의 이름을 모르는 사람은 거의 없을 것이다. 레일즈 프레임워크의 창시자일 뿐 아니라 거침 없는 입담과 자신만의 확고한 방식으로 레일즈라는 거대한 프로젝트를 이끌고 있는 개발자이기 때문이다. 사실 나도 그냥 DHH의 이름을 들으면 떠오르는 점은 ‘레일즈의 창시자’ 정도밖에 없었다. 덧붙이면 그 전에는 PHP…","html":"<p>Ruby on Rails(이하 레일즈) 를 쓰는 사람이라면 DHH(데이비드 하이네마이어 한슨)의 이름을 모르는 사람은 거의 없을 것이다. 레일즈 프레임워크의 창시자일 뿐 아니라 거침 없는 입담과 자신만의 확고한 방식으로 레일즈라는 거대한 프로젝트를 이끌고 있는 개발자이기 때문이다.</p>\n<p>사실 나도 그냥 DHH의 이름을 들으면 떠오르는 점은 ‘레일즈의 창시자’ 정도밖에 없었다. 덧붙이면 그 전에는 PHP로 개발을 하다가 너무 답답해하던 중 루비라는 언어를 접하고, 사랑에 빠져(말 그대로이다. 이는 DHH가 <a href=\"https://harfangk.github.io/2017/01/27/quora-qna-session-with-david-heinemeier-hansson-jan-25-2017-ko.html\">2017년 1월에 Quora에서 진행한 AMA</a>에서 사용한 표현이다.) 레일즈를 개발하게 되었다는 것 정도를 알고 있었다.</p>\n<p>그러다 위에 링크한 DHH의 AMA를 읽게 되었고, 글을 다 읽고 나니 ‘이 사람은 대체 어떤 사람이고, 무슨 생각을 하고 있을까? 배울 점이 있다면 배우고 싶다’ 라는 생각이 들었다. 그렇게 접하게 된 대표적인 저서가 이 <strong>Remote</strong>이다.</p>\n<p>이 책은 ‘원격근무’ 라는 것이 어떤 것인지 소개하면서 흔히 알려진 오해들을 바로잡고, 어떤 방식으로 원격근무를 적용하면 좋을 지 안내하는 가이드 역할을 하는 책이다. 실제로 DHH가 설립한 회사 37signals(현 Basecamp, 이들이 운영하고 있는 원격 근무 서비스의 이름과 같다)는 전면적인 원격 근무 체제를 도입하고 있고, 아주 성공적으로 운영하고 있는 회사 중 하나이다.</p>\n<p>‘원격 근무는 회사에 가지 않고 집에서 작업하기 때문에 관리자의 통제가 힘들다’라는 게 일반적으로 원격 근무를 바라보는 사람들의 생각일 것이다. 하지만 오히려 관리자의 통제가 정말로 필요한 경우는 어떤 것인지 다시 한번 생각해보아야 한다. 근태 관리인가? 아니면 생산성인가? ‘관리자가 직접 직원을 볼 수 없기 때문에 통제가 힘들다’ 는 것은 근태 위주의 생각이고, 근로자가 자신이 가능한한 최적의 환경에서 최고의 생산성을 낼 수 있는 작업방식으로 회사 일에 기여를 하면 자연스레 회사와 근로자 모두에게 이득이 될 것이다.</p>\n<p>더불어 출퇴근 시간으로 하루에 일정 시간을 소비하고, 시간 뿐 아니라 출퇴근 지옥 속에서 정신력까지 소모하는 생활을 살아가는 시대에 ‘출퇴근 문제’를 도려내면 삶이 얼마나 편하게 바뀔 지 상상해보라. 저절로 편안한 기분이 든다.</p>\n<p>요즘은 다양한 도구가 많이 개발되어 있어서(Basecamp, 각종 메신저, 구글 닥스 등) 세계 각지에 떨어진 사람들도 <strong>언어만 통하면</strong> 서로 협력하여 업무를 진행하는데 전혀 무리가 없다. 물론 다시 한번 강조하지만 언어가 통하는게 중요하다. 해외의 회사에 원격근무자로 취직을 한다 하더라도 주로 <strong>영어 쓰기</strong>가 큰 장벽이 될 것이다.</p>\n<p>원격근무자를 고용하는 회사에서 고려할 사항 뿐 아니라 원격근무로 일하는 사람도 고려해야 할 사항들이 여러가지 있다. 보통 집에서 혹은 근처 카페에서 작업을 한다고 하면 딴 짓을 하거나 게으르게 행동하여 생산성이 떨어질까 걱정하는 경우가 많은데, 오히려 이 책은 ‘과도하게 일에 몰입하지 않도록 주의하라’고 경고한다. 나 자신도 비슷한 일을 경험한 적이 있어서 크게 공감되었다. 간단한 작업을 돕고 마무리 지으려고 했는데, 카페에서 화장실 한번 가지 못하고 5시간을 앉아있던 뒤에야 간신히 일어날 수 있었다. 회사에서 있었다면 어떤 식으로든 몸을 일으켜 움직이는게 쉬웠을 것이다.</p>\n<p>마지막으로 이 책은 원격근무를 하는데 필요한 중요한 요소 중 하나는 '동기’임을 강조한다. 관리자 입장에서도 원격근무자의 업무 성과가 제대로 나오지 않는 경우에 주어진 업무가 제대로 구성되어있고 동기를 부여하는 업무인지 확인하라고 말하고 있고, 원격근무자에게도 스스로를 탓하기 보다 근무환경을 다시 한 번 살펴보라고 권한다.</p>\n<p>겉으로 보기엔 형태가 달라 보이지만 거대한 오픈소스 프로젝트도 원격근무의 좋은 예가 될 수 있다. 얼굴도 마주한 적 없는 다양한 사람들이 거대한 프로젝트를 완성시켜나가는 모습은 경이롭다.</p>\n<blockquote>\n<p>우리가 개발한 웹프레임워크인 루비온레일스는 십여 년이 넘는 기간 동안 새로운 기능을 넣고 코드 품질을 개선하면서 진화시켜왔다. 이는 전 세계 십여 개 국가, 수백 개 도시에서 3천 명이 넘는 개발자들(이들은 서로 만난 적도 없는 사람들이다)이 오랜 기간 코드를 발전시킨 결과다.</p>\n<p>원격근무를 도입하는 과정에 의심이 들거나 장애물을 만날 때는 이렇게 생각하면 도움이 된다. “전 세계의 3천 명이 넘는 개발자들을 관리하고 조율하는 프로젝트도 있는데, 이 정도쯤이야!” 아마 골치 아픈 문제가 곧 해결될 수 있으리라는 안도감을 느낄 것이다.</p>\n<p>--- p183, p184</p>\n</blockquote>\n<p>모든 직종이 원격근무를 적극적으로 도입할 수는 없다. 하지만 개발자라는 직업은 지금 시대에 원격근무를 하기에 가장 탁월한 직업이라고 생각한다. 출근하러 집을 나서는 순간부터 '아 집에 돌아가고 싶다’ 라는 생각이 들게 되는 삶 보다 자신이 하는 일을 진정 즐기면서 회사와 함께 상생할 수 있도록 원격근무를 적절히 도입하는 사례가 점점 늘어나는 모습이 기대된다. 나 또한 원격근무라는걸 제대로 해보고 싶다.</p>\n<hr>\n<ul>\n<li>책 링크: <a href=\"http://www.aladin.co.kr/shop/wproduct.aspx?ItemId=50265443\">알라딘</a></li>\n</ul>","id":"27d1f014-ccd0-5938-98c1-beedafcf9453","frontmatter":{"date":"2017-02-26","path":"/posts/remote-the-book-review","title":"‘Remote - 사무실 따윈 필요 없어!’ 를 읽고","tags":["Reading","Remote Job"],"category":"Review"}}],"tagName":"Remote Job"}}